DELETE FROM donations;
ALTER TABLE donations AUTO_INCREMENT = 1;
INSERT INTO donations
  (id, donation_type, pet_id, amount, donation_mode, payment_method, create_datetime,
   user_id, donor_name, donor_phone, donor_email, trade_no, transaction_status)
VALUES
(1001, '醫療救援', NULL, 500, '一次性捐款', 'Credit', '2025-03-20 10:01:00',
 1, '王小明', '0912345678', 'ming@example.com', 'od20250321090100101', '已付款'),

(1002, '線上認養', 1, 300, '一次性捐款', 'ATM', '2025-03-19 15:20:00',
 1, '李小美', '0922333444', 'mei@example.com', 'od20250321090100102', '未付款'),

(1003, '捐給我們', NULL, 450, '定期定額', 'CVS', '2025-03-18 12:40:00',
 1, '陳志強', '0933222111', 'chiang@example.com', 'od20250321090100103', '付款失敗'),

(1004, '醫療救援', NULL, 200, '一次性捐款', 'Credit', '2025-03-17 08:30:00',
 1, '張怡君', '0966888999', 'yi@example.com', 'od20250321090100104', '已付款'),

(1005, '線上認養', 12, 1000, '定期定額', 'CreditPeriod', '2025-03-16 17:15:00',
 1, '林大華', '0955111222', 'hua@example.com', 'od20250321090100105', '未付款'),

(1006, '捐給我們', NULL, 650, '一次性捐款', 'CVS', '2025-03-15 09:10:00',
 1, '黃淑芬', '0988777666', 'shufen@example.com', 'od20250321090100106', '已付款'),

(1007, '醫療救援', NULL, 880, '一次性捐款', 'Credit', '2025-03-14 11:25:00',
 1, '許志偉', '0977666555', 'wei@example.com', 'od20250321090100107', '付款失敗'),

(1008, '線上認養', 13, 300, '一次性捐款', 'ATM', '2025-03-13 14:45:00',
 1, '邱小安', '0933999888', 'an@example.com', 'od20250321090100108', '已付款'),

(1009, '捐給我們', NULL, 120, '定期定額', 'CreditPeriod', '2025-03-12 13:35:00',
 1, '曾信宏', '0911222333', 'xin@example.com', 'od20250321090100109', '未付款'),

(1010, '醫療救援', NULL, 770, '一次性捐款', 'Credit', '2025-03-11 19:50:00',
 1, '簡若琳', '0922111000', 'jo@example.com', 'od20250321090100110', '已付款');
